app/controllers/towns_controller.rb

SELECT "towns".* FROM "towns"
---
  def index
    @towns = Town.all